app/controllers/lab_reports_controller.rb

SELECT "lab_reports".* FROM "lab_reports"
---
  def index
    @lab_reports = LabReport.all

INSERT INTO "lab_reports" ("User_id", "Title", "Description", "Grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["User_id", 1], ["Title", "Важно"], ["Description", "Очень важное дело"], ["Grade", "A"], ["created_at", "2024-07-17 08:32:05.680721"], ["updated_at", "2024-07-17 08:32:05.680721"]]
---
  def create
    @lab_report = LabReport.new(lab_report_params)

    respond_to do |format|
      if @lab_report.save

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lab_report
      @lab_report = LabReport.find(params[:id])