app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("First_name", "Last_name", "Email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["First_name", "Petr"], ["Last_name", "Petrov"], ["Email", "PetrovPetr@mail.ru"], ["created_at", "2024-07-17 07:44:24.990532"], ["updated_at", "2024-07-17 07:44:24.990532"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "Email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["Email", "PetrovPetr03@mail.ru"], ["updated_at", "2024-07-17 07:44:30.923460"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user.destroy!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])